[Killed] BooleanLiteral
src/components/Login/Login.jsx:8:42
 
 const Login = ({ onLogin }) => {
   const [credentials, setCredentials] = useState({ login: '', password: '' });
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState('');
 
killedBy: Login Component renders login form correctly
statusReason: Unable to find an accessible element with the role "button" and name "Войти"

Here are the accessible roles:

  heading:

  Name "Вход в систему":
  <h2

[Killed] BlockStatement
src/components/Login/Login.jsx:11:37
   const [loading, setLoading] = useState(false);
   const [error, setError] = useState('');
 
-  const handleSubmit = async (e) => {
-    e.preventDefault();
-    setLoading(true);
-    setError('');
-
-    try {
-      const response = await login(credentials);
-      const userData = response.data;
-      
-      // Store user data in localStorage
-      localStorage.setItem('user', JSON.stringify(userData));
-      
-      onLogin(userData);
-    } catch (error) {
-      console.error('Login error:', error);
-      if (error.response?.status === 401) {
-        setError('Неверный логин или пароль');
-      } else {
-        setError('Ошибка подключения к серверу');
-      }
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handleSubmit = async (e) => {};
 
   const handleChange = (e) => {
killedBy: Login Component submits the form successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { login: 'testuser', …(1) } ]

Number of calls: 0

[Survived] BooleanLiteral
src/components/Login/Login.jsx:13:16
 
   const handleSubmit = async (e) => {
     e.preventDefault();
-    setLoading(true);
+    setLoading(false);
     setError('');
 

[Killed] BlockStatement
src/components/Login/Login.jsx:16:9
     setLoading(true);
     setError('');
 
-    try {
-      const response = await login(credentials);
-      const userData = response.data;
-      
-      // Store user data in localStorage
-      localStorage.setItem('user', JSON.stringify(userData));
-      
-      onLogin(userData);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Login error:', error);
       if (error.response?.status === 401) {
killedBy: Login Component submits the form successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { login: 'testuser', …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/components/Login/Login.jsx:24:21
       localStorage.setItem('user', JSON.stringify(userData));
       
       onLogin(userData);
-    } catch (error) {
-      console.error('Login error:', error);
-      if (error.response?.status === 401) {
-        setError('Неверный логин или пароль');
-      } else {
-        setError('Ошибка подключения к серверу');
-      }
-    } finally {
+    } catch (error) {} finally {
       setLoading(false);
     }
killedBy: Login Component handles 401 unauthorized error
statusReason: Unable to find an element with the text: Неверный логин или пароль. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; background

[Killed] OptionalChaining
src/components/Login/Login.jsx:26:11
       onLogin(userData);
     } catch (error) {
       console.error('Login error:', error);
-      if (error.response?.status === 401) {
+      if (error.response.status === 401) {
         setError('Неверный логин или пароль');
       } else {
killedBy: Login Component handles generic errors
statusReason: Unable to find an element with the text: Ошибка подключения к серверу. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; backgro

[Killed] ConditionalExpression
src/components/Login/Login.jsx:26:11
       onLogin(userData);
     } catch (error) {
       console.error('Login error:', error);
-      if (error.response?.status === 401) {
+      if (false) {
         setError('Неверный логин или пароль');
       } else {
killedBy: Login Component handles 401 unauthorized error
statusReason: Unable to find an element with the text: Неверный логин или пароль. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; background

[Killed] BlockStatement
src/components/Login/Login.jsx:28:14
       console.error('Login error:', error);
       if (error.response?.status === 401) {
         setError('Неверный логин или пароль');
-      } else {
-        setError('Ошибка подключения к серверу');
-      }
+      } else {}
     } finally {
       setLoading(false);
killedBy: Login Component handles generic errors
statusReason: Unable to find an element with the text: Ошибка подключения к серверу. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; backgro

[Killed] BlockStatement
src/components/Login/Login.jsx:36:31
     }
   };
 
-  const handleChange = (e) => {
-    setCredentials({
-      ...credentials,
-      [e.target.name]: e.target.value
-    });
-  };
+  const handleChange = (e) => {};
 
   return (
killedBy: Login Component updates input fields on change
statusReason: expect(element).toHaveValue(testuser)

Expected the element to have value:
  testuser
Received:

[Killed] BlockStatement
src/components/Login/Login.jsx:126:34
                 boxSizing: 'border-box'
               }}
               placeholder="Введите пароль"
-              onKeyPress={(e) => {
-                if (e.key === 'Enter') {
-                  handleSubmit(e);
-                }
-              }}
+              onKeyPress={(e) => {}}
             />
           </div>
killedBy: Login Component submits form on enter key press in password field
statusReason: expected "vi.fn()" to be called with arguments: [ { login: 'testuser', …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/components/Login/Login.jsx:127:40
               }}
               placeholder="Введите пароль"
               onKeyPress={(e) => {
-                if (e.key === 'Enter') {
-                  handleSubmit(e);
-                }
+                if (e.key === 'Enter') {}
               }}
             />
killedBy: Login Component submits form on enter key press in password field
statusReason: expected "vi.fn()" to be called with arguments: [ { login: 'testuser', …(1) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/Login/Login.jsx:127:21
               }}
               placeholder="Введите пароль"
               onKeyPress={(e) => {
-                if (e.key === 'Enter') {
+                if (false) {
                   handleSubmit(e);
                 }
killedBy: Login Component submits form on enter key press in password field
statusReason: expected "vi.fn()" to be called with arguments: [ { login: 'testuser', …(1) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/Login/Login.jsx:134:12
             />
           </div>
           
-          {error && (
-            <div style={{
-              backgroundColor: '#ff4444',
-              color: '#ffffff',
-              padding: '10px',
-              borderRadius: '4px',
-              marginBottom: '20px',
-              fontSize: '14px',
-              textAlign: 'center'
-            }}>
-              {error}
-            </div>
-          )}
+          {true}
           
           <button
killedBy: Login Component handles 401 unauthorized error
statusReason: Unable to find an element with the text: Неверный логин или пароль. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; background

[Killed] ConditionalExpression
src/components/Login/Login.jsx:134:12
             />
           </div>
           
-          {error && (
-            <div style={{
-              backgroundColor: '#ff4444',
-              color: '#ffffff',
-              padding: '10px',
-              borderRadius: '4px',
-              marginBottom: '20px',
-              fontSize: '14px',
-              textAlign: 'center'
-            }}>
-              {error}
-            </div>
-          )}
+          {false}
           
           <button
killedBy: Login Component handles 401 unauthorized error
statusReason: Unable to find an element with the text: Неверный логин или пароль. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100vh; display: flex; align-items: center; justify-content: center; background
