[Killed] BlockStatement
src/axios/api.js:4:26
 import axios from "axios";
 
 // Dynamically get the base URL from the current window location
-const getBaseURL = () => {
-  const protocol = window.location.protocol;
-  const hostname = window.location.hostname;
-  const port = window.location.port ? `:${window.location.port}` : "";
-  return `${protocol}//${hostname}${port}/api`;
-};
+const getBaseURL = () => {};
 
 const api = axios.create({
killedBy: All tests
statusReason: > ada_oil_app@0.0.0 test:e2e:assignment2
> playwright test --project=chromium QA/test-scripts/e2e/auth.spec.js QA/test-scripts/e2e/api-integration.spec.js QA/test-scripts/e2e/charts.spec.js QA/test-scripts/e2e/high-risk.spec.js



Running 19 tests using 1 worker

[Survived] StringLiteral
src/axios/api.js:8:10
   const protocol = window.location.protocol;
   const hostname = window.location.hostname;
   const port = window.location.port ? `:${window.location.port}` : "";
-  return `${protocol}//${hostname}${port}/api`;
+  return ``;
 };
 
