[Survived] BlockStatement
src/axios/wellService.js:3:50
 import api from "./api";
 
-export const fetch2Hours = (oilField = 'BSK') => {
-  return api.get("/2hours", {
-    params: { oil_field: oilField }
-  });
-};
+export const fetch2Hours = (oilField = 'BSK') => {};
 
 export const fetch2HoursArchive = (oilField = 'BSK', date) => {

[Survived] StringLiteral
src/axios/wellService.js:4:18
 import api from "./api";
 
 export const fetch2Hours = (oilField = 'BSK') => {
-  return api.get("/2hours", {
+  return api.get("", {
     params: { oil_field: oilField }
   });

[Survived] BlockStatement
src/axios/wellService.js:9:63
   });
 };
 
-export const fetch2HoursArchive = (oilField = 'BSK', date) => {
-  return api.get("/2hours/archive", {
-    params: {
-      oil_field: oilField,
-      date: date
-    }
-  });
-};
+export const fetch2HoursArchive = (oilField = 'BSK', date) => {};
 
 export const getAvailableArchiveDates = (oilField = 'BSK') => {

[Survived] ObjectLiteral
src/axios/wellService.js:11:13
 
 export const fetch2HoursArchive = (oilField = 'BSK', date) => {
   return api.get("/2hours/archive", {
-    params: {
-      oil_field: oilField,
-      date: date
-    }
+    params: {}
   });
 };

[Survived] BlockStatement
src/axios/wellService.js:18:63
   });
 };
 
-export const getAvailableArchiveDates = (oilField = 'BSK') => {
-  return api.get("/2hours/archive/dates", {
-    params: { oil_field: oilField }
-  });
-};
+export const getAvailableArchiveDates = (oilField = 'BSK') => {};
 
 export const fetchWells = () => {

[Killed] BlockStatement
src/axios/wellService.js:24:33
   });
 };
 
-export const fetchWells = () => {
-  return api.get("/wells");
-};
+export const fetchWells = () => {};
 
 export const fetchWellsABC = () => {
killedBy: All tests
statusReason: > ada_oil_app@0.0.0 test:e2e:assignment2
> playwright test --project=chromium QA/test-scripts/e2e/auth.spec.js QA/test-scripts/e2e/api-integration.spec.js QA/test-scripts/e2e/charts.spec.js QA/test-scripts/e2e/high-risk.spec.js



Running 19 tests using 1 worker

[Survived] BlockStatement
src/axios/wellService.js:28:36
   return api.get("/wells");
 };
 
-export const fetchWellsABC = () => {
-  return api.get("/wells/abc");
-};
+export const fetchWellsABC = () => {};
 
 export const fetchABCByWell = () => {

[Survived] BlockStatement
src/axios/wellService.js:32:37
   return api.get("/wells/abc");
 };
 
-export const fetchABCByWell = () => {
-  return api.get("/wells/abc/");
-};
+export const fetchABCByWell = () => {};
 
 export const fetchLast10Wells = () => {

[Survived] BlockStatement
src/axios/wellService.js:36:39
   return api.get("/wells/abc/");
 };
 
-export const fetchLast10Wells = () => {
-  return api.get("/well/last10");
-};
+export const fetchLast10Wells = () => {};
 
 export const fetchWellData = (wellName) => {

[Survived] BlockStatement
src/axios/wellService.js:40:44
   return api.get("/well/last10");
 };
 
-export const fetchWellData = (wellName) => {
-  return api.get("/well/data", {
-    params: {
-      well: wellName,
-    },
-  });
-};
+export const fetchWellData = (wellName) => {};
 
 export const fetchBSKWells = () => {

[Survived] ObjectLiteral
src/axios/wellService.js:42:13
 
 export const fetchWellData = (wellName) => {
   return api.get("/well/data", {
-    params: {
-      well: wellName,
-    },
+    params: {},
   });
 };

[Survived] BlockStatement
src/axios/wellService.js:48:36
   });
 };
 
-export const fetchBSKWells = () => {
-  return api.get("/wells/bsk");
-};
+export const fetchBSKWells = () => {};
 
 export const fetchProgressOil = () => {

[Survived] StringLiteral
src/axios/wellService.js:49:18
 };
 
 export const fetchBSKWells = () => {
-  return api.get("/wells/bsk");
+  return api.get("");
 };
 

[Survived] BlockStatement
src/axios/wellService.js:52:39
   return api.get("/wells/bsk");
 };
 
-export const fetchProgressOil = () => {
-  return api.get("/progress-oil");
-};
+export const fetchProgressOil = () => {};
 
 export const fetchLastUpdate = () => {

[Survived] BlockStatement
src/axios/wellService.js:56:38
   return api.get("/progress-oil");
 };
 
-export const fetchLastUpdate = () => {
-  return api.get("/wells/last-update");
-};
+export const fetchLastUpdate = () => {};
 
 export const fetchChrpArchiveReport = ({ startDate, endDate, well }) => {

[Survived] StringLiteral
src/axios/wellService.js:57:18
 };
 
 export const fetchLastUpdate = () => {
-  return api.get("/wells/last-update");
+  return api.get("");
 };
 

[Survived] BlockStatement
src/axios/wellService.js:60:73
   return api.get("/wells/last-update");
 };
 
-export const fetchChrpArchiveReport = ({ startDate, endDate, well }) => {
-  return api.get("/chrp/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
-  });
-};
+export const fetchChrpArchiveReport = ({ startDate, endDate, well }) => {};
 
 export const fetchAgzuArchiveReport = ({ startDate, endDate, well }) => {

[Survived] ObjectLiteral
src/axios/wellService.js:61:42
 };
 
 export const fetchChrpArchiveReport = ({ startDate, endDate, well }) => {
-  return api.get("/chrp/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
-  });
+  return api.get("/chrp/archive/report", {});
 };
 

[Survived] ObjectLiteral
src/axios/wellService.js:62:13
 
 export const fetchChrpArchiveReport = ({ startDate, endDate, well }) => {
   return api.get("/chrp/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
+    params: {}
   });
 };

[Survived] BlockStatement
src/axios/wellService.js:70:73
   });
 };
 
-export const fetchAgzuArchiveReport = ({ startDate, endDate, well }) => {
-  return api.get("/agzu/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
-  });
-};
+export const fetchAgzuArchiveReport = ({ startDate, endDate, well }) => {};
 
 export const getAvailableVlagomerDates = () => {

[Survived] ObjectLiteral
src/axios/wellService.js:71:42
 };
 
 export const fetchAgzuArchiveReport = ({ startDate, endDate, well }) => {
-  return api.get("/agzu/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
-  });
+  return api.get("/agzu/archive/report", {});
 };
 

[Survived] ObjectLiteral
src/axios/wellService.js:72:13
 
 export const fetchAgzuArchiveReport = ({ startDate, endDate, well }) => {
   return api.get("/agzu/archive/report", {
-    params: {
-      startDate,
-      endDate,
-      well
-    }
+    params: {}
   });
 };

[Survived] BlockStatement
src/axios/wellService.js:80:48
   });
 };
 
-export const getAvailableVlagomerDates = () => {
-  return api.get("/vlagomer-history/dates");
-};
+export const getAvailableVlagomerDates = () => {};
 
 export const fetchVlagomerHistory = (date = null) => {

[Survived] BlockStatement
src/axios/wellService.js:84:54
   return api.get("/vlagomer-history/dates");
 };
 
-export const fetchVlagomerHistory = (date = null) => {
-  const url = date
-    ? `/vlagomer-history/${date}`
-    : "/vlagomer-history";
-  return api.get(url);
-};
+export const fetchVlagomerHistory = (date = null) => {};
 
 export const fetchKPIProduction = () => {

[Survived] BlockStatement
src/axios/wellService.js:91:41
   return api.get(url);
 };
 
-export const fetchKPIProduction = () => {
-  return api.get("/kpi/production");
-};
+export const fetchKPIProduction = () => {};
 
 export const fetchKPIInjection = () => {

[Survived] BlockStatement
src/axios/wellService.js:95:40
   return api.get("/kpi/production");
 };
 
-export const fetchKPIInjection = () => {
-  return api.get("/kpi/injection");
-};
+export const fetchKPIInjection = () => {};
 
 export const fetchOilLossData = (params = {}) => {

[Survived] BlockStatement
src/axios/wellService.js:99:50
   return api.get("/kpi/injection");
 };
 
-export const fetchOilLossData = (params = {}) => {
-  return api.get("/oil-loss", {
-    params: {
-      well: params.well,
-      startDate: params.startDate,
-      endDate: params.endDate
-    }
-  });
-};
+export const fetchOilLossData = (params = {}) => {};
 
 export const fetchOilLossWells = () => {

[Survived] StringLiteral
src/axios/wellService.js:100:18
 };
 
 export const fetchOilLossData = (params = {}) => {
-  return api.get("/oil-loss", {
+  return api.get("", {
     params: {
       well: params.well,

[Survived] BlockStatement
src/axios/wellService.js:109:40
   });
 };
 
-export const fetchOilLossWells = () => {
-  return api.get("/oil-loss/wells");
-};
+export const fetchOilLossWells = () => {};
 
 export const analyzeOilLoss = (data) => {

[Survived] StringLiteral
src/axios/wellService.js:110:18
 };
 
 export const fetchOilLossWells = () => {
-  return api.get("/oil-loss/wells");
+  return api.get("");
 };
 

[Survived] BlockStatement
src/axios/wellService.js:113:41
   return api.get("/oil-loss/wells");
 };
 
-export const analyzeOilLoss = (data) => {
-  return api.post("/oil-loss/analysis", data);
-};
+export const analyzeOilLoss = (data) => {};
 
 export const login = (credentials) => {

[Survived] BlockStatement
src/axios/wellService.js:117:39
   return api.post("/oil-loss/analysis", data);
 };
 
-export const login = (credentials) => {
-  return api.post("/auth/login", credentials);
-};
+export const login = (credentials) => {};
 
 export const fetchUsers = () => {

[Survived] StringLiteral
src/axios/wellService.js:118:19
 };
 
 export const login = (credentials) => {
-  return api.post("/auth/login", credentials);
+  return api.post("", credentials);
 };
 

[Survived] BlockStatement
src/axios/wellService.js:121:33
   return api.post("/auth/login", credentials);
 };
 
-export const fetchUsers = () => {
-  return api.get("/admin/users");
-};
+export const fetchUsers = () => {};
 
 export const createUser = (userData) => {

[Survived] BlockStatement
src/axios/wellService.js:125:41
   return api.get("/admin/users");
 };
 
-export const createUser = (userData) => {
-  return api.post("/admin/users", userData);
-};
+export const createUser = (userData) => {};
 
 export const deleteUser = (userId) => {

[Survived] BlockStatement
src/axios/wellService.js:129:39
   return api.post("/admin/users", userData);
 };
 
-export const deleteUser = (userId) => {
-  return api.delete(`/admin/users/${userId}`);
-};
+export const deleteUser = (userId) => {};
 
 export const updateUser = (userId, userData) => {

[Survived] StringLiteral
src/axios/wellService.js:130:21
 };
 
 export const deleteUser = (userId) => {
-  return api.delete(`/admin/users/${userId}`);
+  return api.delete(``);
 };
 

[Survived] BlockStatement
src/axios/wellService.js:133:49
   return api.delete(`/admin/users/${userId}`);
 };
 
-export const updateUser = (userId, userData) => {
-  return api.put(`/admin/users/${userId}`, userData);
-};
+export const updateUser = (userId, userData) => {};
 
 export const fetchAGZUCategories = () => {

[Survived] StringLiteral
src/axios/wellService.js:134:18
 };
 
 export const updateUser = (userId, userData) => {
-  return api.put(`/admin/users/${userId}`, userData);
+  return api.put(``, userData);
 };
 

[Survived] BlockStatement
src/axios/wellService.js:137:42
   return api.put(`/admin/users/${userId}`, userData);
 };
 
-export const fetchAGZUCategories = () => {
-  return api.get("/agzu/categories");
-};
+export const fetchAGZUCategories = () => {};
 
 export const fetchAGZUTags = (category) => {

[Survived] BlockStatement
src/axios/wellService.js:141:44
   return api.get("/agzu/categories");
 };
 
-export const fetchAGZUTags = (category) => {
-  return api.get(`/agzu/tags/${encodeURIComponent(category)}`);
-};
+export const fetchAGZUTags = (category) => {};
 
 export const fetchAGZUWellData = (wellName) => {

[Survived] BlockStatement
src/axios/wellService.js:145:48
   return api.get(`/agzu/tags/${encodeURIComponent(category)}`);
 };
 
-export const fetchAGZUWellData = (wellName) => {
-  return api.get("/well/agzu-data", {
-    params: {
-      well: wellName,
-    },
-  });
-};
+export const fetchAGZUWellData = (wellName) => {};
 
 export const fetchNotifications = (params = {}) => {

[Survived] BlockStatement
src/axios/wellService.js:153:52
   });
 };
 
-export const fetchNotifications = (params = {}) => {
-  return api.get("/notifications", {
-    params: {
-      status: params.status || 'open',
-      oil_field: params.oil_field,
-      limit: params.limit || 50
-    }
-  });
-};
+export const fetchNotifications = (params = {}) => {};
 
 export const fetchNotificationCount = (params = {}) => {

[Survived] ConditionalExpression
src/axios/wellService.js:156:15
 export const fetchNotifications = (params = {}) => {
   return api.get("/notifications", {
     params: {
-      status: params.status || 'open',
+      status: true,
       oil_field: params.oil_field,
       limit: params.limit || 50

[Survived] ConditionalExpression
src/axios/wellService.js:156:15
 export const fetchNotifications = (params = {}) => {
   return api.get("/notifications", {
     params: {
-      status: params.status || 'open',
+      status: false,
       oil_field: params.oil_field,
       limit: params.limit || 50

[Survived] ConditionalExpression
src/axios/wellService.js:158:14
     params: {
       status: params.status || 'open',
       oil_field: params.oil_field,
-      limit: params.limit || 50
+      limit: false
     }
   });

[Survived] LogicalOperator
src/axios/wellService.js:158:14
     params: {
       status: params.status || 'open',
       oil_field: params.oil_field,
-      limit: params.limit || 50
+      limit: params.limit && 50
     }
   });

[Survived] BlockStatement
src/axios/wellService.js:163:56
   });
 };
 
-export const fetchNotificationCount = (params = {}) => {
-  return api.get("/notifications/count", {
-    params: {
-      status: params.status || 'open',
-      oil_field: params.oil_field
-    }
-  });
-};
+export const fetchNotificationCount = (params = {}) => {};
 
 export const checkWellStatus = () => {

[Survived] StringLiteral
src/axios/wellService.js:164:18
 };
 
 export const fetchNotificationCount = (params = {}) => {
-  return api.get("/notifications/count", {
+  return api.get("", {
     params: {
       status: params.status || 'open',

[Survived] ObjectLiteral
src/axios/wellService.js:164:42
 };
 
 export const fetchNotificationCount = (params = {}) => {
-  return api.get("/notifications/count", {
-    params: {
-      status: params.status || 'open',
-      oil_field: params.oil_field
-    }
-  });
+  return api.get("/notifications/count", {});
 };
 

[Survived] ObjectLiteral
src/axios/wellService.js:165:13
 
 export const fetchNotificationCount = (params = {}) => {
   return api.get("/notifications/count", {
-    params: {
-      status: params.status || 'open',
-      oil_field: params.oil_field
-    }
+    params: {}
   });
 };

[Survived] LogicalOperator
src/axios/wellService.js:166:15
 export const fetchNotificationCount = (params = {}) => {
   return api.get("/notifications/count", {
     params: {
-      status: params.status || 'open',
+      status: params.status && 'open',
       oil_field: params.oil_field
     }

[Survived] BlockStatement
src/axios/wellService.js:172:38
   });
 };
 
-export const checkWellStatus = () => {
-  return axiosInstance.get('/wells/check-status');
-};
+export const checkWellStatus = () => {};
 
 export const createNotification = (notificationData) => {

[Survived] BlockStatement
src/axios/wellService.js:176:57
   return axiosInstance.get('/wells/check-status');
 };
 
-export const createNotification = (notificationData) => {
-  return axiosInstance.post('/notifications/create', notificationData);
-};
+export const createNotification = (notificationData) => {};
 
 export const updateNotificationStatus = (notificationId, status) => {

[Survived] StringLiteral
src/axios/wellService.js:177:29
 };
 
 export const createNotification = (notificationData) => {
-  return axiosInstance.post('/notifications/create', notificationData);
+  return axiosInstance.post("", notificationData);
 };
 

[Survived] BlockStatement
src/axios/wellService.js:180:69
   return axiosInstance.post('/notifications/create', notificationData);
 };
 
-export const updateNotificationStatus = (notificationId, status) => {
-  return api.put(`/notifications/${notificationId}/status`, { status });
-};
+export const updateNotificationStatus = (notificationId, status) => {};

[Survived] ObjectLiteral
src/axios/wellService.js:181:61
 };
 
 export const updateNotificationStatus = (notificationId, status) => {
-  return api.put(`/notifications/${notificationId}/status`, { status });
+  return api.put(`/notifications/${notificationId}/status`, {});
 };
