[Survived] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:7:66
 import styles from "./NotificationBell.module.css";
 
 const NotificationBell = () => {
-  const [isNotificationsOpen, setIsNotificationsOpen] = useState(false);
+  const [isNotificationsOpen, setIsNotificationsOpen] = useState(true);
   const [notificationCount, setNotificationCount] = useState(0);
   const [loading, setLoading] = useState(false);

[Survived] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:9:42
 const NotificationBell = () => {
   const [isNotificationsOpen, setIsNotificationsOpen] = useState(false);
   const [notificationCount, setNotificationCount] = useState(0);
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const intervalRef = useRef(null);
   const shownNotificationsRef = useRef(new Set());

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:13:45
   const intervalRef = useRef(null);
   const shownNotificationsRef = useRef(new Set());
 
-  const loadNotificationCount = async () => {
-    try {
-      setLoading(true);
-      const response = await fetchNotificationCount({
-        status: 'open',
-        oil_field: 'BSK'
-      });
-      setNotificationCount(response.data.count);
-    } catch (error) {
-      console.error("[Notification] Failed to fetch count:", error);
-    } finally {
-      setLoading(false);
-    }
-  };
+  const loadNotificationCount = async () => {};
 
   const showWellStopPopup = (well) => {
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:14:9
   const shownNotificationsRef = useRef(new Set());
 
   const loadNotificationCount = async () => {
-    try {
-      setLoading(true);
-      const response = await fetchNotificationCount({
-        status: 'open',
-        oil_field: 'BSK'
-      });
-      setNotificationCount(response.data.count);
-    } catch (error) {
+    try {} catch (error) {
       console.error("[Notification] Failed to fetch count:", error);
     } finally {
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:21:21
         oil_field: 'BSK'
       });
       setNotificationCount(response.data.count);
-    } catch (error) {
-      console.error("[Notification] Failed to fetch count:", error);
-    } finally {
+    } catch (error) {} finally {
       setLoading(false);
     }
killedBy: NotificationBell Component handles error fetching count
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/NotificationBell/NotificationBell.jsx:22:21
       });
       setNotificationCount(response.data.count);
     } catch (error) {
-      console.error("[Notification] Failed to fetch count:", error);
+      console.error("", error);
     } finally {
       setLoading(false);
killedBy: NotificationBell Component handles error fetching count
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "[Notification] Failed to fetch count:",

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:23:15
       setNotificationCount(response.data.count);
     } catch (error) {
       console.error("[Notification] Failed to fetch count:", error);
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 
killedBy: NotificationBell Component handles error fetching count
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:48:9
       </div>
     `;
 
-    if (!document.getElementById('well-stop-styles')) {
+    if (true) {
       const styleSheet = document.createElement('style');
       styleSheet.id = 'well-stop-styles';

[Survived] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:48:9
       </div>
     `;
 
-    if (!document.getElementById('well-stop-styles')) {
+    if (document.getElementById('well-stop-styles')) {
       const styleSheet = document.createElement('style');
       styleSheet.id = 'well-stop-styles';

[Survived] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:131:30
     }
 
     const closeBtn = popup.querySelector('.well-stop-popup-close');
-    const closePopup = () => {
-      popup.style.animation = 'slideOutRight 0.3s ease-in';
-      setTimeout(() => {
-        if (popup.parentNode) {
-          popup.parentNode.removeChild(popup);
-        }
-      }, 300);
-    };
+    const closePopup = () => {};
 
     closeBtn.addEventListener('click', closePopup);

[NoCoverage] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:133:24
     const closeBtn = popup.querySelector('.well-stop-popup-close');
     const closePopup = () => {
       popup.style.animation = 'slideOutRight 0.3s ease-in';
-      setTimeout(() => {
-        if (popup.parentNode) {
-          popup.parentNode.removeChild(popup);
-        }
-      }, 300);
+      setTimeout(() => {}, 300);
     };
 

[NoCoverage] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:134:13
     const closePopup = () => {
       popup.style.animation = 'slideOutRight 0.3s ease-in';
       setTimeout(() => {
-        if (popup.parentNode) {
+        if (true) {
           popup.parentNode.removeChild(popup);
         }

[NoCoverage] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:134:31
     const closePopup = () => {
       popup.style.animation = 'slideOutRight 0.3s ease-in';
       setTimeout(() => {
-        if (popup.parentNode) {
-          popup.parentNode.removeChild(popup);
-        }
+        if (popup.parentNode) {}
       }, 300);
     };

[Survived] StringLiteral
src/components/NotificationBell/NotificationBell.jsx:144:17
     setTimeout(closePopup, 8000);
     document.body.appendChild(popup);
 
-    console.log('[Notification] Popup shown for well:', well.well);
+    console.log("", well.well);
   };
 

[Killed] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:150:11
   const checkRecentWellStops = async () => {
     try {
       const response = await fetch('/api/notifications/recent-well-stops?oil_field=BSK');
-      if (!response.ok) {
+      if (response.ok) {
         console.error('[Notification] Failed to fetch, status:', response.status);
         return;
killedBy: NotificationBell Component polls for recent well stops and shows popup
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:150:25
   const checkRecentWellStops = async () => {
     try {
       const response = await fetch('/api/notifications/recent-well-stops?oil_field=BSK');
-      if (!response.ok) {
-        console.error('[Notification] Failed to fetch, status:', response.status);
-        return;
-      }
+      if (!response.ok) {}
 
       const notifications = await response.json();
killedBy: NotificationBell Component handles fetch error in checkRecentWellStops
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "[Notification] Failed to fetch, status:",

[Killed] StringLiteral
src/components/NotificationBell/NotificationBell.jsx:151:23
     try {
       const response = await fetch('/api/notifications/recent-well-stops?oil_field=BSK');
       if (!response.ok) {
-        console.error('[Notification] Failed to fetch, status:', response.status);
+        console.error("", response.status);
         return;
       }
killedBy: NotificationBell Component handles fetch error in checkRecentWellStops
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "[Notification] Failed to fetch, status:",

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:158:45
       const notifications = await response.json();
       console.log('[Notification] Polled, found', notifications.length, 'recent well stops');
       
-      notifications.forEach(notification => {
-        if (!shownNotificationsRef.current.has(notification.id)) {
-          console.log('[Notification] New well stop:', notification.well, 'delta:', notification.delta);
-          shownNotificationsRef.current.add(notification.id);
-          
-          showWellStopPopup({
-            well: notification.well,
-            c_current: parseFloat(notification.delta || 0)
-          });
-          
-          loadNotificationCount();
-        }
-      });
+      notifications.forEach(notification => {});
       
       if (shownNotificationsRef.current.size > 100) {
killedBy: NotificationBell Component polls for recent well stops and shows popup
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:159:66
       console.log('[Notification] Polled, found', notifications.length, 'recent well stops');
       
       notifications.forEach(notification => {
-        if (!shownNotificationsRef.current.has(notification.id)) {
-          console.log('[Notification] New well stop:', notification.well, 'delta:', notification.delta);
-          shownNotificationsRef.current.add(notification.id);
-          
-          showWellStopPopup({
-            well: notification.well,
-            c_current: parseFloat(notification.delta || 0)
-          });
-          
-          loadNotificationCount();
-        }
+        if (!shownNotificationsRef.current.has(notification.id)) {}
       });
       
killedBy: NotificationBell Component polls for recent well stops and shows popup
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Killed] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:159:13
       console.log('[Notification] Polled, found', notifications.length, 'recent well stops');
       
       notifications.forEach(notification => {
-        if (!shownNotificationsRef.current.has(notification.id)) {
+        if (shownNotificationsRef.current.has(notification.id)) {
           console.log('[Notification] New well stop:', notification.well, 'delta:', notification.delta);
           shownNotificationsRef.current.add(notification.id);
killedBy: NotificationBell Component polls for recent well stops and shows popup
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

Ignored nodes: comments, script, style
<html>

[Survived] StringLiteral
src/components/NotificationBell/NotificationBell.jsx:160:75
       
       notifications.forEach(notification => {
         if (!shownNotificationsRef.current.has(notification.id)) {
-          console.log('[Notification] New well stop:', notification.well, 'delta:', notification.delta);
+          console.log('[Notification] New well stop:', notification.well, "", notification.delta);
           shownNotificationsRef.current.add(notification.id);
           

[Survived] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:165:35
           
           showWellStopPopup({
             well: notification.well,
-            c_current: parseFloat(notification.delta || 0)
+            c_current: parseFloat(false)
           });
           

[Survived] LogicalOperator
src/components/NotificationBell/NotificationBell.jsx:165:35
           
           showWellStopPopup({
             well: notification.well,
-            c_current: parseFloat(notification.delta || 0)
+            c_current: parseFloat(notification.delta && 0)
           });
           

[NoCoverage] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:172:53
         }
       });
       
-      if (shownNotificationsRef.current.size > 100) {
-        shownNotificationsRef.current = new Set(
-          Array.from(shownNotificationsRef.current).slice(-50)
-        );
-      }
+      if (shownNotificationsRef.current.size > 100) {}
     } catch (error) {
       console.error('[Notification] Error checking well stops:', error);

[Survived] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:172:11
         }
       });
       
-      if (shownNotificationsRef.current.size > 100) {
+      if (false) {
         shownNotificationsRef.current = new Set(
           Array.from(shownNotificationsRef.current).slice(-50)

[NoCoverage] MethodExpression
src/components/NotificationBell/NotificationBell.jsx:174:11
       
       if (shownNotificationsRef.current.size > 100) {
         shownNotificationsRef.current = new Set(
-          Array.from(shownNotificationsRef.current).slice(-50)
+          Array.from(shownNotificationsRef.current)
         );
       }

[NoCoverage] UnaryOperator
src/components/NotificationBell/NotificationBell.jsx:174:59
       
       if (shownNotificationsRef.current.size > 100) {
         shownNotificationsRef.current = new Set(
-          Array.from(shownNotificationsRef.current).slice(-50)
+          Array.from(shownNotificationsRef.current).slice(+50)
         );
       }

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:177:21
           Array.from(shownNotificationsRef.current).slice(-50)
         );
       }
-    } catch (error) {
-      console.error('[Notification] Error checking well stops:', error);
-    }
+    } catch (error) {}
   };
 
killedBy: NotificationBell Component handles thrown error in checkRecentWellStops
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "[Notification] Error checking well stops:",

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:182:19
     }
   };
 
-  useEffect(() => {
-    console.log('[Notification] Component mounted');
-    loadNotificationCount();
-    
-    intervalRef.current = setInterval(() => {
-      checkRecentWellStops();
-      loadNotificationCount();
-    }, 2000);
-    
-    return () => {
-      console.log('[Notification] Component unmounting');
-      if (intervalRef.current) clearInterval(intervalRef.current);
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   const handleBellClick = () => {
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:186:45
     console.log('[Notification] Component mounted');
     loadNotificationCount();
     
-    intervalRef.current = setInterval(() => {
-      checkRecentWellStops();
-      loadNotificationCount();
-    }, 2000);
+    intervalRef.current = setInterval(() => {}, 2000);
     
     return () => {
killedBy: NotificationBell Component polls for recent well stops and shows popup
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:191:18
       loadNotificationCount();
     }, 2000);
     
-    return () => {
-      console.log('[Notification] Component unmounting');
-      if (intervalRef.current) clearInterval(intervalRef.current);
-    };
+    return () => {};
   }, []);
 

[Survived] StringLiteral
src/components/NotificationBell/NotificationBell.jsx:192:19
     }, 2000);
     
     return () => {
-      console.log('[Notification] Component unmounting');
+      console.log("");
       if (intervalRef.current) clearInterval(intervalRef.current);
     };

[Survived] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:193:11
     
     return () => {
       console.log('[Notification] Component unmounting');
-      if (intervalRef.current) clearInterval(intervalRef.current);
+      if (false) clearInterval(intervalRef.current);
     };
   }, []);

[Survived] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:193:11
     
     return () => {
       console.log('[Notification] Component unmounting');
-      if (intervalRef.current) clearInterval(intervalRef.current);
+      if (true) clearInterval(intervalRef.current);
     };
   }, []);

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:197:33
     };
   }, []);
 
-  const handleBellClick = () => {
-    setIsNotificationsOpen(true);
-  };
+  const handleBellClick = () => {};
 
   const handleCloseNotifications = () => {
killedBy: NotificationBell Component opens and closes notifications modal
statusReason: Unable to find an element by: [data-testid="notifications-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:198:28
   }, []);
 
   const handleBellClick = () => {
-    setIsNotificationsOpen(true);
+    setIsNotificationsOpen(false);
   };
 
killedBy: NotificationBell Component opens and closes notifications modal
statusReason: Unable to find an element by: [data-testid="notifications-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] BlockStatement
src/components/NotificationBell/NotificationBell.jsx:201:42
     setIsNotificationsOpen(true);
   };
 
-  const handleCloseNotifications = () => {
-    setIsNotificationsOpen(false);
-    setTimeout(loadNotificationCount, 500);
-  };
+  const handleCloseNotifications = () => {};
 
   return (
killedBy: NotificationBell Component opens and closes notifications modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="notifications-modal"
>
  <button>
    Close
  </button>

[Killed] BooleanLiteral
src/components/NotificationBell/NotificationBell.jsx:202:28
   };
 
   const handleCloseNotifications = () => {
-    setIsNotificationsOpen(false);
+    setIsNotificationsOpen(true);
     setTimeout(loadNotificationCount, 500);
   };
killedBy: NotificationBell Component opens and closes notifications modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="notifications-modal"
>
  <button>
    Close
  </button>

[Killed] LogicalOperator
src/components/NotificationBell/NotificationBell.jsx:215:10
         disabled={loading}
       >
         <span className={styles.bellIcon}>🔔</span>
-        {notificationCount > 0 && (
-          <span className={styles.badge}>
-            {notificationCount > 99 ? '99+' : notificationCount}
-          </span>
-        )}
+        {notificationCount > 0 || <span className={styles.badge}>
+            {notificationCount > 99 ? '99+' : notificationCount}
+          </span>}
       </button>
       <Notifications
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] EqualityOperator
src/components/NotificationBell/NotificationBell.jsx:215:10
         disabled={loading}
       >
         <span className={styles.bellIcon}>🔔</span>
-        {notificationCount > 0 && (
+        {notificationCount <= 0 && (
           <span className={styles.badge}>
             {notificationCount > 99 ? '99+' : notificationCount}
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] EqualityOperator
src/components/NotificationBell/NotificationBell.jsx:217:14
         <span className={styles.bellIcon}>🔔</span>
         {notificationCount > 0 && (
           <span className={styles.badge}>
-            {notificationCount > 99 ? '99+' : notificationCount}
+            {notificationCount <= 99 ? '99+' : notificationCount}
           </span>
         )}
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"

[Killed] ConditionalExpression
src/components/NotificationBell/NotificationBell.jsx:217:14
         <span className={styles.bellIcon}>🔔</span>
         {notificationCount > 0 && (
           <span className={styles.badge}>
-            {notificationCount > 99 ? '99+' : notificationCount}
+            {true ? '99+' : notificationCount}
           </span>
         )}
killedBy: NotificationBell Component renders correctly and loads notification count
statusReason: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="_bellButton_d5eec0"
      title="Notifications"
