[Survived] ArrayDeclaration
src/states/WellsABCContext.jsx:7:48
 const WellsABCContext = createContext();
 
 const WellsABCContextProvider = ({ children }) => {
-    const [wellsGrid, setWellsGrid] = useState([]);
+    const [wellsGrid, setWellsGrid] = useState(["Stryker was here"]);
     const [wellsChart, setWellsChart] = useState([]);
     const [wells, setWells] = useState([]);

[NoCoverage] BlockStatement
src/states/WellsABCContext.jsx:12:35
     const [wells, setWells] = useState([]);
     const [selectedWell, setSelectedWell] = useState([]);
 
-    const resetWellsChart = () => {
-        setWellsChart(wells);
-    };
+    const resetWellsChart = () => {};
 
     useEffect(() => {

[Killed] BlockStatement
src/states/WellsABCContext.jsx:18:17
 
     useEffect(() => {
         const fetchData = async () => {
-            try {
-                const response = await fetchWellsABC();
-                if (response && response.data) {
-                    const wellsData = response.data;
-
-                    const lastDate = wellsData
-                        .filter((well) => well.well === "BSK_0002")
-                        .at(-2)["date"];
-                    const wellsGridDate = wellsData.filter(
-                        (well) => well.date === lastDate
-                    );
-                    setWells(wellsData);
-                    setWellsChart(wellsData);
-                    setWellsGrid(wellsGridDate);
-                    
-                    const filtered = wellsData.filter((well) => well.well === "BSK_0002");
-                    if (filtered.length > 0) {
-                        setSelectedWell(filtered);
-                    } else {
-                        console.warn("No well matching 'BSK_0002' was found");
-                    }
-                } else {
-                    console.error("No data found in response");
-                }
-            } catch (error) {
+            try {} catch (error) {
                 console.error("Error fetching wells:", error.message || error);
             }
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4
Received:
  0

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/states/WellsABCContext.jsx:20:21
         const fetchData = async () => {
             try {
                 const response = await fetchWellsABC();
-                if (response && response.data) {
+                if (response || response.data) {
                     const wellsData = response.data;
 
killedBy: WellsABCContext handles empty data response
statusReason: expected "error" to be called with arguments: [ 'No data found in response' ]

Received:

  1st error call:

  [
-   "No data found in response",

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:20:21
         const fetchData = async () => {
             try {
                 const response = await fetchWellsABC();
-                if (response && response.data) {
+                if (false) {
                     const wellsData = response.data;
 
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4
Received:
  0

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/states/WellsABCContext.jsx:23:38
                 if (response && response.data) {
                     const wellsData = response.data;
 
-                    const lastDate = wellsData
-                        .filter((well) => well.well === "BSK_0002")
+                    const lastDate = wellsData
                         .at(-2)["date"];
                     const wellsGridDate = wellsData.filter(
killedBy: WellsABCContext handles response without BSK_0002
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:24:43
                     const wellsData = response.data;
 
                     const lastDate = wellsData
-                        .filter((well) => well.well === "BSK_0002")
+                        .filter((well) => true)
                         .at(-2)["date"];
                     const wellsGridDate = wellsData.filter(
killedBy: WellsABCContext handles response without BSK_0002
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] EqualityOperator
src/states/WellsABCContext.jsx:24:43
                     const wellsData = response.data;
 
                     const lastDate = wellsData
-                        .filter((well) => well.well === "BSK_0002")
+                        .filter((well) => well.well !== "BSK_0002")
                         .at(-2)["date"];
                     const wellsGridDate = wellsData.filter(
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4
Received:
  0

Ignored nodes: comments, script, style

[Survived] UnaryOperator
src/states/WellsABCContext.jsx:25:29
 
                     const lastDate = wellsData
                         .filter((well) => well.well === "BSK_0002")
-                        .at(-2)["date"];
+                        .at(+2)["date"];
                     const wellsGridDate = wellsData.filter(
                         (well) => well.date === lastDate

[Killed] MethodExpression
src/states/WellsABCContext.jsx:26:43
                     const lastDate = wellsData
                         .filter((well) => well.well === "BSK_0002")
                         .at(-2)["date"];
-                    const wellsGridDate = wellsData.filter(
-                        (well) => well.date === lastDate
-                    );
+                    const wellsGridDate = wellsData;
                     setWells(wellsData);
                     setWellsChart(wellsData);
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  4

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:27:35
                         .filter((well) => well.well === "BSK_0002")
                         .at(-2)["date"];
                     const wellsGridDate = wellsData.filter(
-                        (well) => well.date === lastDate
+                        (well) => false
                     );
                     setWells(wellsData);
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  0

[Killed] EqualityOperator
src/states/WellsABCContext.jsx:27:35
                         .filter((well) => well.well === "BSK_0002")
                         .at(-2)["date"];
                     const wellsGridDate = wellsData.filter(
-                        (well) => well.date === lastDate
+                        (well) => well.date !== lastDate
                     );
                     setWells(wellsData);
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  3

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:33:65
                     setWellsChart(wellsData);
                     setWellsGrid(wellsGridDate);
                     
-                    const filtered = wellsData.filter((well) => well.well === "BSK_0002");
+                    const filtered = wellsData.filter((well) => false);
                     if (filtered.length > 0) {
                         setSelectedWell(filtered);
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  0

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:33:65
                     setWellsChart(wellsData);
                     setWellsGrid(wellsGridDate);
                     
-                    const filtered = wellsData.filter((well) => well.well === "BSK_0002");
+                    const filtered = wellsData.filter((well) => true);
                     if (filtered.length > 0) {
                         setSelectedWell(filtered);
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  4

[Killed] BlockStatement
src/states/WellsABCContext.jsx:34:46
                     setWellsGrid(wellsGridDate);
                     
                     const filtered = wellsData.filter((well) => well.well === "BSK_0002");
-                    if (filtered.length > 0) {
-                        setSelectedWell(filtered);
-                    } else {
+                    if (filtered.length > 0) {} else {
                         console.warn("No well matching 'BSK_0002' was found");
                     }
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  0

[Killed] EqualityOperator
src/states/WellsABCContext.jsx:34:25
                     setWellsGrid(wellsGridDate);
                     
                     const filtered = wellsData.filter((well) => well.well === "BSK_0002");
-                    if (filtered.length > 0) {
+                    if (filtered.length <= 0) {
                         setSelectedWell(filtered);
                     } else {
killedBy: WellsABCContext fetches data and initializes state correctly on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  0

[NoCoverage] BlockStatement
src/states/WellsABCContext.jsx:36:28
                     const filtered = wellsData.filter((well) => well.well === "BSK_0002");
                     if (filtered.length > 0) {
                         setSelectedWell(filtered);
-                    } else {
-                        console.warn("No well matching 'BSK_0002' was found");
-                    }
+                    } else {}
                 } else {
                     console.error("No data found in response");

[Killed] BlockStatement
src/states/WellsABCContext.jsx:39:24
                     } else {
                         console.warn("No well matching 'BSK_0002' was found");
                     }
-                } else {
-                    console.error("No data found in response");
-                }
+                } else {}
             } catch (error) {
                 console.error("Error fetching wells:", error.message || error);
killedBy: WellsABCContext handles empty data response
statusReason: expected "error" to be called with arguments: [ 'No data found in response' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/states/WellsABCContext.jsx:40:35
                         console.warn("No well matching 'BSK_0002' was found");
                     }
                 } else {
-                    console.error("No data found in response");
+                    console.error("");
                 }
             } catch (error) {
killedBy: WellsABCContext handles empty data response
statusReason: expected "error" to be called with arguments: [ 'No data found in response' ]

Received:

  1st error call:

  [
-   "No data found in response",

[Killed] BlockStatement
src/states/WellsABCContext.jsx:42:29
                 } else {
                     console.error("No data found in response");
                 }
-            } catch (error) {
-                console.error("Error fetching wells:", error.message || error);
-            }
+            } catch (error) {}
         };
 
killedBy: WellsABCContext handles response without BSK_0002
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] LogicalOperator
src/states/WellsABCContext.jsx:43:56
                     console.error("No data found in response");
                 }
             } catch (error) {
-                console.error("Error fetching wells:", error.message || error);
+                console.error("Error fetching wells:", error.message && error);
             }
         };
killedBy: WellsABCContext handles fetch error
statusReason: expected "error" to be called with arguments: [ 'Error fetching wells:', …(1) ]

Received:

  1st error call:

  [
    "Error fetching wells:",

[Killed] ConditionalExpression
src/states/WellsABCContext.jsx:43:56
                     console.error("No data found in response");
                 }
             } catch (error) {
-                console.error("Error fetching wells:", error.message || error);
+                console.error("Error fetching wells:", true);
             }
         };
killedBy: WellsABCContext handles fetch error
statusReason: expected "error" to be called with arguments: [ 'Error fetching wells:', …(1) ]

Received:

  1st error call:

  [
    "Error fetching wells:",
