[Killed] BlockStatement
src/axios/wellService.js:172:38
   });
 };
 
-export const checkWellStatus = () => {
-  return api.get('/wells/check-status');
-};
+export const checkWellStatus = () => {};
 
 export const createNotification = (notificationData) => {
killedBy: checkWellStatus calls GET /wells/check-status
statusReason: expected "vi.fn()" to be called with arguments: [ '/wells/check-status' ]

Number of calls: 0

[Killed] StringLiteral
src/axios/wellService.js:173:18
 };
 
 export const checkWellStatus = () => {
-  return api.get('/wells/check-status');
+  return api.get("");
 };
 
killedBy: checkWellStatus calls GET /wells/check-status
statusReason: expected "vi.fn()" to be called with arguments: [ '/wells/check-status' ]

Received:

  1st vi.fn() call:

  [
-   "/wells/check-status",

[Killed] BlockStatement
src/axios/wellService.js:176:57
   return api.get('/wells/check-status');
 };
 
-export const createNotification = (notificationData) => {
-  return api.post('/notifications/create', notificationData);
-};
+export const createNotification = (notificationData) => {};
 
 export const updateNotificationStatus = (notificationId, status) => {
killedBy: createNotification calls POST /notifications/create with notification data
statusReason: expected "vi.fn()" to be called with arguments: [ '/notifications/create', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/axios/wellService.js:177:19
 };
 
 export const createNotification = (notificationData) => {
-  return api.post('/notifications/create', notificationData);
+  return api.post("", notificationData);
 };
 
killedBy: createNotification calls POST /notifications/create with notification data
statusReason: expected "vi.fn()" to be called with arguments: [ '/notifications/create', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/notifications/create",
