[Killed] BlockStatement
src/states/WellsContext.jsx:6:48
 
 const WellsContext = createContext();
 
-const WellsContextProvider = ({ children }) => {
-    const [fond, setFond] = useState(0);
-    const [wells, setWells] = useState([]);
-
-    useEffect(() => {
-        fetchWells()
-            .then((response) => {
-                setWells(response.data);
-            })
-            .catch((error) => {
-                console.error("There was an error while fetching the wells!", error);
-            });
-    }, []);
-
-    return (
-        <WellsContext.Provider value={{ fond, setFond, wells, setWells }}>
-            {children}
-        </WellsContext.Provider>
-    );
-};
+const WellsContextProvider = ({ children }) => {};
 
 export { WellsContext, WellsContextProvider };
killedBy: WellsContext fetches wells on mount and sets them in context
statusReason: Unable to find an element by: [data-testid="fond"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/states/WellsContext.jsx:10:21
     const [fond, setFond] = useState(0);
     const [wells, setWells] = useState([]);
 
-    useEffect(() => {
-        fetchWells()
-            .then((response) => {
-                setWells(response.data);
-            })
-            .catch((error) => {
-                console.error("There was an error while fetching the wells!", error);
-            });
-    }, []);
+    useEffect(() => {}, []);
 
     return (
killedBy: WellsContext fetches wells on mount and sets them in context
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:
  0

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/states/WellsContext.jsx:12:33
 
     useEffect(() => {
         fetchWells()
-            .then((response) => {
-                setWells(response.data);
-            })
+            .then((response) => {})
             .catch((error) => {
                 console.error("There was an error while fetching the wells!", error);
killedBy: WellsContext fetches wells on mount and sets them in context
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:
  0

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/states/WellsContext.jsx:15:31
             .then((response) => {
                 setWells(response.data);
             })
-            .catch((error) => {
-                console.error("There was an error while fetching the wells!", error);
-            });
+            .catch((error) => {});
     }, []);
 
killedBy: WellsContext handles fetch errors gracefully (logs to console)
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
