[Killed] ArrowFunction
src/states/UserContext.js:5:24
 
 export const UserContext = createContext(null);
 
-export const useUser = () => useContext(UserContext);
+export const useUser = () => undefined;
 
killedBy: UserContext provides the user context value
statusReason: Unable to find an element with the text: Test User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      No User
    </div>
